*<2024-05-15 Wed>
**** DONE Primer on Elliptic Curve Cryptography
DEADLINE: <2024-05-15 Wed>
CLOCK: [2024-05-15 Wed 11:00]--[2024-05-15 Wed 12:00] => 1:00
**** DONE Pairing-friendly Curves
DEADLINE: <2024-05-15 Wed>
CLOCK: [2024-05-15 Wed 12:00]--[2024-05-15 Wed 13:00] => 1:00
**** DONE BN254 For The Rest Of Us
DEADLINE: <2024-05-15 Wed 16:00>
:LOGBOOK:
CLOCK: [2024-05-15 Wed 14:10]--[2024-05-15 Wed 16:01] =>  1:51
:END:
**** DONE Pippenger Algorithm
DEADLINE: <2024-05-15 Wed 17:00>
**** DONE Read MSM papers
DEADLINE: <2024-05-15 Wed 18:00>
**** TODO Check out Hardcaml's implementation of the MSM
DEADLINE: <2024-05-16 Thu 12:00>
**** TODO Check out the aws-fpga services and the dev toolkit and check viability
DEADLINE: <2024-05-16 Thu 13:00>
**** DONE Revise the topics of groups, fields, finite fields
DEADLINE: <2024-05-16 Thu 11:30>
**** TODO Create a Confluence document with the list of papers and documents to share with Vineet
DEADLINE: <2024-05-16 Thu 12:00>
**** TODO CycloneMSM & PipeMSM
DEADLINE: <2024-05-17 Fri 17:00>
**** TODO Blaze - Ingonyama
DEADLINE: <2024-05-17 Fri 17:00>

* <2024-05-16 Thu>
**** TODO Create GitHub account
DEADLINE: <2024-05-16 Thu 16:00>
**** TODO Setup some tasks on Jira and check out Confluence.
DEADLINE: <2024-05-16 Thu 16:00>
